import React from 'react';
import {PageWithHeader} from '../../../components';
import './style.less';

class Agreement extends React.PureComponent {
  render() {
    return (

      <PageWithHeader title="能源星球服务协议" id="page-agreement">
        <div className="body">
          <p>“能源星球”为杭州能信科技有限公司开发运营的手机端app软件。以下如无特别说明，本协议中所称“能源星球”即指杭州能信科技有限公司。</p>
          <p>请您阅读本协议,本协议是约定您（以下简称“用户”或“您”）和能源星球之间权利义务关系的有效协议。</p>
          <p className="bold">【审慎阅读】在您使用能源星球提供的各项服务之前，<span className="underline bold">请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体或下划线标识，您应重点阅读。</span></p>
          <p>本协议自您通过网络页面以点击“确认”等形式（具体以页面展示为准）接受并首次使用本服务时成立并生效，且视为您已充分理解并同意接受本协议及其项下规则，如您拒绝同意本协议，将无法使用本服务。如您违反本协议约定，能源星球有权依照违反情况，随时单方限制、中止或终止向您提供服务，并有权追究您的相关责任。</p>
          <p className="sub-title">一、协议的范围与变更</p>
          <p>1、本协议项下的服务是指能源星球向用户提供的包括但不限于数据采集、去中心化数据交易、通过区块链技术实时记录光伏发电数据等服务（以下简称“本服务”）。</p>
          <p>2、您应理解，由于互联网高速发展，您与能源星球签署的本协议列明的条款并不能完整罗列并覆盖您与能源星球所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，您明确知悉并同意：</p>
          <p className="underline bold">（1）本协议内容及您在使用能源星球某一特定服务时，基于该服务可能产生的单独的协议、相关业务规则等（以下统称为“单项协议”）构成统一整体，且上述单项协议一经正式发布，即为本协议不可分割的组成部分，与本协议具有同等法律效力，您同样应当遵守。</p>
          <p className="underline bold">（2）能源星球有权根据法律法规、监管政策或业务发展需求等原因，随时对本协议、《隐私政策》及其他单项协议等内容进行修改、增加或删减，能源星球将以网页公告、App推送、电子邮件、短信等方式对该等变更予以公布、通知。变更后的条款自以上述方式公布、通知之日起生效。若您在本协议变更的条款生效后，仍继续使用本服务的，则视为您已认真阅读、充分理解并同意接受该等变更，包括能源星球对本协议及其他服务条款随时所做的任何修改；如果您不接受修改后的协议，应当停止使用能源星球提供的软件或服务。</p>
          <p className="sub-title">二、账号注册与安全</p>
          <p>1、您在使用能源星球的服务之前需要注册帐号，本协议仅约定您注册、使用账号时应遵循的基本规则，您在使用能源星球提供的部分服务时可能涉及其他的具体规则，包括但不限于需进行特定认证、开通特定权限等操作，届时您应遵守相应单项协议。</p>
          <p className="underline bold">2、用户必须是具备完全民事行为能力的自然人，或者是具有合法经营资格的实体组织。无民事行为能力人、限制民事行为能力人以及无经营或特定经营资格的组织不当注册为本平台用户或超过其民事权利或行为能力范围从事交易的，其与能源星球之间的任何服务协议自始无效。能源星球一经发现，有权立即注销该用户使用本服务及相关服务的资格且无需承担任何责任，并有权追究其使用本服务所产生的相关法律责任。</p>
          <p>3、能源星球特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。能源星球将运用各种安全技术并尽商业合理的努力来保护您的账号信息，但因您保管不善可能导致遭受账号、密码泄露或被盗用等情形，责任由您自行承担。</p>
          <p>4、能源星球不会将您的账号信息转移或披露给任何非关联的第三方，除非：</p>
          <p>（1）相关法律法规或法院、政府机关要求；</p>
          <p>（2）为完成合并、分立、收购或资产转让而转移；</p>
          <p>（3）为提供您要求的服务所必需。</p>
          <p>5、如果您在注册时提供任何不真实、不准确、不完整或不能反映当前情况的资料的，或能源星球有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况的，能源星球保留停止您使用本服务的权利。如因您资料的不真实、不准确、不完整或不能反映当前情况而给能源星球或其关联公司造成损失的，您应负责赔偿。若您以虚假信息骗取账户注册或注册资料存在违法和不良信息的，能源星球有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册账户名称的，能源星球有权注销该账户，并向政府主管部门进行报告。能源星球有权对您的注册账户进行安全性管理，包括但不限于采取限制、冻结、注销用户账户措施。</p>
          <p className="sub-title">三、服务使用规则与声明</p>
          <p>1、您应当通过能源星球提供或认可的方式使用本服务。您依本协议条款所取得的权利不可转让。</p>
          <p>2、您不得使用未经能源星球授权的插件、外挂或第三方工具对本协议项下的服务进行干扰、破坏、修改或施加其他影响。</p>
          <p>3、您理解并同意，能源星球的服务是按照现有技术和条件所能达到的现状提供的。能源星球会尽最大努力向您提供服务，确保服务的连贯性和安全性；但能源星球不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</p>
          <p>4、您理解并同意，您使用本服务时会耗用您的终端设备和带宽等资源，您应自行准备与相关服务有关的终端设备（如电脑、调制解调器等装置），并承担所需的费用（如电话费、上网费等费用）。</p>
          <p>5、若能源星球依托“软件”向您提供服务，您还应遵守以下约定：</p>
          <p>（1）您在使用本服务的过程中可能需要下载软件，对于这些软件，能源星球给予您一项个人/单独的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些软件；</p>
          <p>（2）为了改善用户体验、保证服务的安全性及产品功能的一致性，能源星球可能会对软件进行更新。您应该将相关软件更新到最新版本，否则能源星球并不保证其能正常使用；</p>
          <p>（3）能源星球可能为不同的终端设备开发不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。您可以直接从能源星球的网站上获取软件，也可以从得到能源星球授权的第三方获取。如果您从未经能源星球授权的第三方获取软件或与软件名称相同的安装程序，能源星球无法保证该软件能够正常使用，并对因此给您造成的损失不予负责；</p>
          <p>（4）除非能源星球给予您事先书面许可，您不得从事下列任一行为：</p>
          <p>1）删除软件及其副本上关于著作权的信息；</p>
          <p>2）对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现软件的源代码；</p>
          <p>3）对能源星球拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p>
          <p>4）对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经能源星球授权的第三方工具/服务接入软件和相关系统；</p>
          <p>5）通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p>
          <p>6）通过非能源星球开发、授权的第三方软件、插件、外挂、系统，登录或使用能源星球软件及服务，或制作、发布、传播非能源星球开发、授权的第三方软件、插件、外挂、系统。</p>
          <p>6、您通过本服务进行的任何操作均由您自行承担责任。您使用本服务时不得违反国家法律法规，亦不得侵害他人合法权益。您应理解并同意，如您被他人投诉侵权或您投诉他人侵权，能源星球有权将争议中相关方的主体、联系方式、投诉相关内容等必要信息提供给其他争议方或相关部门，以便及时解决投诉纠纷，保护他人合法权益。</p>
          <p className="sub-title">四、服务费用</p>
          <p>1、能源星球的部分服务是以收费方式提供的，如您使用收费服务，请遵守相关的单项协议。</p>
          <p>2、能源星球可能根据实际需要对收费服务的收费标准、方式进行修改和变更，能源星球也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，能源星球将通过网站公告、App推送通知、邮件、短信等形式通知您。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。</p>
          <p className="sub-title">五、第三方提供的产品或服务</p>
          <p>您在使用能源星球提供的服务时，可能会涉及通过能源星球平台使用第三方提供的产品或服务，届时，除遵守本协议约定外，您还应遵守第三方的用户协议及相关政策。能源星球和第三方对可能出现的纠纷在法律规定和相关协议约定的范围内各自承担责任。</p>
          <p className="sub-title">六、权属声明</p>
          <p>1、能源星球的任何商标、品牌Logo、品牌名称、商业字号、产品名称等文字、图形及其组合，以及本服务涉及的其他标识、徽记、名称等，未经能源星球书面授权，任何人不得以任何方式展示、使用或做其他处理（包括但不限于复制、传播、展示、镜像、上传、下载），也不得向他人表明您有权展示、使用或做其他处理。</p>
          <p>2、能源星球提供所有的产品、服务、技术与所有程序的知识产权均归属于能源星球或归其权利人所有。除非能源星球另行声明，在本服务中提供的信息内容（包括但不限于文字、图形、图片、照片、音频、视频、图标、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密和其他所有相关权利）均归能源星球所有。未经能源星球许可，任何人不得擅自以任何形式使用如上内容或创造相关衍生作品（包括但不限于通过程序或设备监视、复制、转播、展示、镜像、上传、下载任何上述内容）。除非能源星球与您另有约定，能源星球授权您浏览、复制、打印和传播属于能源星球的上述信息内容，均不得用于商业目的且所有信息内容及其任何部分的使用都必须包括此权利声明。</p>
          <p>3、用户在使用本服务过程中所产生的内容的知识产权均归用户或相关权利人所有。</p>
          <p className="sub-title">七、用户行为及责任</p>
          <p>1、您在使用本服务过程中自行上传、提供、发布的相关信息，包括但不限于用户名称、公司名称、 联系人及联络信息，相关图片、资讯等，该等信息均由用户自行提供，用户须对其提供的任何信息依法承担全部责任。</p>
          <p className="underline bold">2、您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，不得危害网络安全，不得利用能源星球提供的服务从事他人侵犯名誉、隐私、知识产权和其他合法权益的活动，包括但不限于：</p>
          <p className="underline bold">（1）发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；</p>
          <p className="underline bold">（2）发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</p>
          <p className="underline bold">（3）恶意虚构事实、隐瞒真相以误导、欺骗他人；</p>
          <p className="underline bold">（4）发布、传送、传播广告信息及垃圾信息；</p>
          <p className="underline bold">5）其他法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的行为。</p>
          <p className="underline bold">3、尽管有前述提示，能源星球不对您使用能源星球提供服务的用途和目的承担任何责任。如果您违反本协议约定，导致任何第三方损害的，您应当独立承担责任；能源星球因此遭受损失的，您也应当一并赔偿。</p>
          <p className="underline bold">4、如果您违反了本协议约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求能源星球给予协助。造成损害的，您应依法予以赔偿，能源星球不承担任何责任。</p>
          <p>5、如果能源星球发现或收到他人举报您存在违反本协议约定的行为，能源星球有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，能源星球有权视用户的行为性质，采取包括但不限于暂停或终止服务，限制、冻结或终止账号使用，追究法律责任等措施。</p>
          <p className="sub-title">八、个人信息保护</p>
          <p>1、本协议所指的“个人信息”，是指《电信和互联网用户个人信息保护规定》第4条关于个人信息、《最高人民法院关于审理利用信息网络侵害人身权益民事纠纷案件适用法律若干问题的规定》第12条关于个人隐私、以及未来不时制定或修订的法律法规中明确规定的个人信息应包括的内容。</p>
          <p className="underline bold">2、能源星球尊重并保护您的隐私权，并且将以高度勤勉和审慎的义务对待您的个人信息。在您使用能源星球提供的服务时，能源星球将仅为遵守国家法律法规及监管规定，以及为向您提供服务及提升服务质量之目的，在必要范围内收集、存储、保护、使用及对外披露您的个人信息，并将严格遵守相关法律法规。</p>
          <p className="sub-title">九、遵守当地法律监管</p>
          <p className="underline bold">1、您在使用本服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。</p>
          <p className="underline bold">2、您应避免因使用本服务而使能源星球卷入政治和公共事件，否则能源星球有权暂停或终止对您的服务。</p>
          <p className="sub-title">十、不可抗力及其他免责事由</p>
          <p className="underline bold">1、您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，能源星球将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失，能源星球在法律允许的范围内免责。</p>
          <p className="underline bold">2、在法律允许的范围内，能源星球对以下情形导致的服务中断或受阻不承担责任：</p>
          <p className="underline bold">（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</p>
          <p className="underline bold">（2）用户或能源星球的电脑软件、系统、硬件和通信线路出现故障；</p>
          <p className="underline bold">（3）用户操作不当；</p>
          <p className="underline bold">（4）用户通过非能源星球授权的方式使用本服务；</p>
          <p className="underline bold">（5）其他能源星球无法控制或合理预见的情形。</p>
          <p className="underline bold">3、您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，能源星球不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：</p>
          <p className="underline bold">（1）来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；</p>
          <p className="underline bold">（2）因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；</p>
          <p className="underline bold">（3）其他因网络信息或用户行为引起的风险。</p>
          <p className="underline bold">4、能源星球依据本协议约定获得处理违法违规内容的权利，但该权利不构成能源星球的义务或承诺，能源星球不能保证及时发现违法行为或进行相应处理。</p>
          <p className="sub-title">十一、服务的变更、中断、终止</p>
          <p className="underline bold">1、您理解并同意，能源星球有权自主决定经营策略。能源星球可能会对服务内容进行变更，也可能会中断、中止或终止服务。</p>
          <p>2、在能源星球发生合并、分立、收购、资产转让时，能源星球可向第三方转让本服务下相关资产；能源星球也可在单方通知您后，将本协议下部分或全部服务转交由第三方运营或履行。具体受让主体以能源星球通知的为准。</p>
          <p className="underline bold">3、如发生下列任何一种情形，能源星球有权不经通知而中断或终止向您提供的服务：</p>
          <p>（1）根据法律规定您应提交真实信息，而您提供的资料不真实、或与注册时信息不一致又未能提供合理证明；</p>
          <p>（2）您违反相关法律法规或本协议的约定；</p>
          <p>（3）按照法律规定或主管部门的要求；</p>
          <p>（4）出于安全的原因或其他必要的情形。</p>
          <p className="underline bold">4、能源星球有权按本协议的约定进行收费。若您未按时足额付费，能源星球有权中断、中止或终止提供服务。</p>
          <p className="underline bold">5、您有责任自行备份存储在本服务中的数据。如果您的服务被终止，能源星球可以从服务器上永久地删除您的数据,但法律法规另有规定的除外。服务终止后，能源星球没有义务向您返还数据。</p>
          <p className="sub-title">十二、管辖与法律适用</p>
          <p className="underline bold">1、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
          <p className="underline bold">2、本协议签订地为中华人民共和国浙江省杭州市余杭区。</p>
          <p className="underline bold">3、若您和能源星球之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
          <p>4、本协议所有条款的标题仅为阅读便利，本身并无实际涵义，不作为本协议涵义解释之依据。</p>
          <p>5、如本协议任何条款被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性，其余条款应持续有效，对双方具有约束力。</p>
          <p className="sub-title">十三、其他</p>
          <p>如果您对本协议或本服务有意见或建议，可与能源星球官方联系（【官网地址】），我们会给予您必要的帮助。</p>
        </div>
      </PageWithHeader>
    )
  }
}

export default Agreement;
